[
  {
    "articleTitle": "When Ratan Tata made this request to SEBI chief for TCS' first CEO FC Kohli during TCS IPO",
    "articleReleaseDate": "  Oct 12, 2024, 18:07 IST",
    "article": "Ratan Naval Tata, the revered chairman emeritus of Tata Group, passed away, leaving behind a legacy of transformative leadership. Notably, under his stewardship, Tata Group's revenue grew from $4 billion in 1991 to over $100 billion by 2012 (when he retired).Read More Ratan Naval Tata passed away earlier this week at a hospital in Mumbai. Tata Group's chairman emeritus was India Inc's most-loved and respected leader. As several industry doyens said in their tribute to , what he said was regarded as universal truth. ’s demise marks the end of an extraordinary corporate journey, one that not only made Tata Group a global giant but also set new benchmarks for Indian industry on the world map.Under his visionary leadership, Tata Group's revenue surged from $4 billion in 1991 to over $100 billion by 2012, when he retired, making it the first Indian business group to achieve this feat. One major milestone in this was the IPO of the group's software company -- Tata Consultancy Services -- in the year 2004. TCS made history with the first $1 billion initial public offering (IPO) by a private-sector company in India. TCS is Tata Group's most valuable and India's second-largest company in market cap. led TCS' public listing. He even took part in some roadshows done for the TCS IPO. Writing for Economic Times, Sunil Sanghai, founder and CEO of NovaaOne Capital, shared an incident from the TCS IPO that showed how, as he wrote, \"the tallest member of the Indian industry () remembered every contribution and it was very important for him to recognise them.\" You May LikeElevate Your Life Style With 60+ AmenitiesCelestia at Siddha Sky, Sion NXUndoJuly 2004, with torrential Bombay monsoon lashing outside, Mr. got off the podium at the Ball room of Taj Mahal Hotel, Colaba. He had just announced the launch of Tata Consultancy Services (TCS) Initial Public Offering (IPO), the most high-profile IPO of Indian capital markets then. There were quite a few capital market players and media people still waiting to interact with him. In this chaos he expressed his keenness to go meet the then SEBI Chairman, Mr. G N Bajpai. Almost at no notice, I, a young investment banker then, was handed the task of setting up this meeting at SEBI’s Nariman Point office.I was clueless as to why Mr. Tata would want to rush to meet the SEBI chairman, and that too in such wet weather conditions. He had barely completed a very successful launch conference and there were people still wanting to meet him. But when we arrived at the SEBI headquarters, I was pleasantly surprised with the agenda of the meeting.Mr. Tata started the meeting by saying, he requested for a short notice meeting for two reasons. First, he wanted to thank SEBI for their support through the IPO process. Second, and equally importantly, in his persuasive deep voice he said that Mr. F C Kohli, first CEO of TCS, had been instrumental in building an institution like TCS for the Tata Group. Mr. Tata therefore expressed his desire to allot one share to Mr. F C Kohli as a symbolic gesture in recognition of his contribution.In another gesture of his humility, the bankers who accompanied Mr. Tata for the TCS IPO roadshow were very pleasantly surprised to receive a handwritten personal letter of appreciation from him. These small acts and values in totality are what made Mr. Tata the Redwood tree of the Indian corporate world – the tallest figure that leaves a mark that stays with you always. "
  },
  {
    "articleTitle": "Salaried employees take note! Reduce TDS from salary with new Form 12BAA released by CBDT - details here",
    "articleReleaseDate": "  Oct 17, 2024, 22:42 IST",
    "article": "The new form will enable employees to provide information about TCS and TDS from other sources. (AI image) TDS for salaried employees: The Central Board of Direct Taxes (CBDT) has introduced a new form, Form 12BAA, to facilitate the implementation of the Budget 2024 announcement regarding the adjustment of TDS and TCS from other sources against salary TDS.Employees will use Form 12BAA to inform their employers about tax deductions from sources other than their salaries.These sources may include fixed deposits, insurance commissions, dividends from equity shares, or tax collected while making purchases, such as buying a car or foreign currency.According to the PIB press release dated October 17, 2024, \"Vide CBDT Notification No. 112/2024 dated 15.10.2024, the Income-tax Rules, 1962 ('the Rules') have been amended, introducing Form No. 12BAA as the prescribed statement of particulars required under sub-section (2B) of Section 192 of the Act. Employees must provide these particulars to their employers, who are responsible for making payments under sub-section (1) of Section 192. The employer, in turn, shall deduct TDS on salary after taking into account the furnished particulars.\"Also Read | Beware of ITR refund scam! You may lose lakhs with new income tax refund fraud - check I-T department advisory You May LikeUndo?CBDT has introduced a new form that allows employees to inform their employers about Tax Deducted at Source (TDS) and Tax Collected at Source (TCS) from other sources of income. This change aims to address the issue of employers not adjusting the taxes paid by employees against other sources when deducting TDS from their salaries.Previously, employers would deduct TDS based on the declaration provided by the employee, considering investments and expenses eligible for tax deductions.However, the newly notified form from the CBDT will enable employees to provide information about TCS collected and TDS deducted from other sources. By doing so, employees can reduce the tax deduction from their salaries, helping them manage their cash flow more effectively and increase their disposable income.The new law came into effect on October 1, 2024, and the CBDT notified the new form on October 15, 2024.Abhishek Soni, CEO of Tax2Win.in, an ITR filing website, told ET, \"An employee who wants to lower the tax deducted from salary and hike the take-home pay can use Form 12BAA to inform the employer about taxes deducted from any other source of income or taxes paid while making expenses. Form 12BAA is similar to Form 12BB, which the employee uses to make an investment declaration to the employer so that TDS on salary is deducted accordingly. \"The CBDT has also modified Form 12BB to enable employees to provide additional details about their income beyond salary, report house property losses with verification, and claim TCS credit through their employer. According to Sudhir Kaushik, CEO of Taxspanner, these changes are intended to curb tax evasion and facilitate faster processing of Income Tax Returns (ITR).Also Read | New TDS rates from October 1, 2024: What are the revised tax deducted at source rates? Check list of changes for these transactions The 2024 Budget has introduced measures to streamline the process of claiming credit for tax collected at source and tax deducted at source for salaried individuals. This move aims to address the cash flow challenges faced by employees and reduce the compliance burden associated with claiming refunds.The Budget announcement states, \"Representations have been received that credit of TCS paid should be allowed while computing the amount of tax to be deducted on salary income of the employees as this will help in avoiding cash flow issues for employees. Similarly, all TDS may be taken into account for the purpose of deduction of tax from the salary income of employees. Moreover when the TCS etc is not taken into account, the same is required to be claimed as a refund by the employee which adds to the compliance process. In order to ease compliance, it is proposed that sub-section (2B) of section 192 may be amended to expand the scope of the said sub-section to include any tax deducted or collected under the provisions of Chapter XVII-B or Chapter XVII-BB, as the case may be, to be taken into account for the purposes of making the deduction under sub-section (1) of section 192.\" "
  },
  {
    "articleTitle": "TCS expands operations in Poland with new delivery centre: What this means for the company's European operations",
    "articleReleaseDate": "  Sep 21, 2024, 12:53 IST",
    "article": "Tata Consultancy Services (TCS) has launched a new delivery centre in Warsaw, Poland, aiming to double its workforce to over 1200 within a year. This expansion signifies TCS' commitment to the European market and leverages Poland's growing ICT talent pool for niche technology skills and cognitive business processes. Tata Consultancy Services (TCS) has launched a new delivery centre in Warsaw, Poland, expanding its operations in the country. With the new delivery centre, TCS aims to double its workforce to 1200-plus in a year to support its further growth in the region. Located in the heart of the city, the new delivery centre is said to showcase TCS’ capabilities across industries and technologies.India's biggest IT company TCS set up operations in Poland in 2006.The company’s Polish expansion is said to be indicative of its wider unparalleled commitment to the European market, where TCS has had a presence for more than 45 years.Poland is home to one of the largest European technology talent pools and the centre will tap into the growing Polish Information and Communication Technology (ICT) talent pool to support the needs of customers in niche technology skills and cognitive business and domain processes. It forms a part of TCS’ European delivery network, which facilitates the delivery of hyper-connected services to its customers across Europe. This ensures that all TCS customers globally benefit from consistent, near-shore experiences tailored to their unique cultural, compliance, language, and technological requirements. The centre was inaugurated by the Indian Ambassador to Poland Nagma Mallick, TCS’ head of Europe Sapthagiri Chapalapalli and General Manager for TCS in Eastern Europe Prabal Datta. You May LikeUndoEuropean governments are also facing ambitious growth targets for digital skills, infrastructures and business capabilities by 2030 to uphold the region’s competitiveness at the forefront of enterprise and innovation. TCS’ European investment strategically reflects this need, and the company has been steadily expanding its European near-shore delivery capabilities. It recently opened a new Aviation Digital Centre in Lisbon with Portugal’s national airline TAP and expanded its TCS Pace™ innovation network with its new Pace Studio in Stockholm. TCS recently inaugurated a first-of-its-kind AI Centre of Excellence at its Paris Pace PortTM.Nagma Mallick, Indian Ambassador to Poland, said, “I am proud to witness this milestone event. This event marks a new chapter in the expansion of India’s IT prowess in Poland and further strengthens the economic ties between our two nations. It is a gratifying moment for both TCS and the Embassy of India in Poland.” Sapthagiri Chapalapalli, Head of Europe, TCS, said, “Poland is a strategic location for TCS, and we are proud of our long-standing commitment to the region. For nearly twenty years, TCS has been establishing solid partnerships with prominent Polish and global companies. Our decision to invest and scale our presence demonstrates our faith in the Polish economy and the exceptional talent available here to support our customers across the world.” "
  },
  {
    "articleTitle": "TCS CEO and MD K Krithivasan mourns Ratan Tata's demise: All my colleagues at TCS and I will remain forever ...",
    "articleReleaseDate": " Updated: Oct 12, 2024, 14:12 IST",
    "article": "Tata Sons chairman emeritus Ratan Naval Tata died at a Mumbai hospital on Wednesday night, October 9, at the age of 86 years. As chairman for more than two decades, he took Tata Group global, clinching eye-catching deals, including iconic British assets like steelmaker Corus, luxury carmaker Jaguar Land Rover, the world's second-largest tea company Tetley and closer home -- India's most-valuable IT company Tata Consultancy Services (TCS). India's largest IT company TCS was scheduled to release its second-quarter earnings for FY25. The company canceled the earnings press conference and subsequent interviews in the wake of the death of . TCS' website's Home Page too has changed as a mark of respect to the departed soul. Here's the executive's note: You May LikeElevate Your Life Style With 60+ AmenitiesCelestia at Siddha Sky, Sion NXUndo“With deep sorrow, we mourn the passing of Mr. Ratan Naval Tata, an extraordinary individual whose life and legacy will always be a guiding light for Tata Consultancy Services. His wisdom, compassion, and commitment to uplifting the lives of millions, made him revered across the world.His remarkable leadership, marked by a unique blend of humility and confidence, guided TCS through transformative global expansions, with a deep sense of service to the communities we operate in and the values we cherish. He had a rare gift for making those around him feel valued and heard, earning the admiration and respect of all who had the privilege of knowing him. His approach to leadership, paired with his genuine care for people, has left an indelible mark on every one of us.All my colleagues at TCS and I will remain forever inspired by him as we carry forward his vision.” "
  },
  {
    "articleTitle": "HCLTech revenue up 5.9%, to roll out hikes in October",
    "articleReleaseDate": " Updated: Oct 15, 2024, 00:55 IST",
    "article": "BENGALURU: HCLTech's revenue rose by 5.9% in constant currency in the Sept quarter compared to the year-ago period. Its revenue grew by 1.6% quarter-on-quarter despite the State Street divestment. The firm consolidated its operations in India, acquiring a 49% stake in State Street HCL Services, a joint venture between the global financial services firm and HCL UK, for $170 million.?State Street has partnered with HCLTech for more than a decade. Its larger peer, TCS, saw a revenue growth of 5.5% over the same period. "
  },
  {
    "articleTitle": "TCS cancels Q2 earnings press conference",
    "articleReleaseDate": "  Oct 10, 2024, 10:30 IST",
    "article": "Tata Consultancy Services Ltd (TCS) is set to declare its financial results today, with analysts expecting Q2 earnings growth to be in the low single digit. The IT services company, according to a PTI report, has cancelled its press conference and interviews due to the death of Ratan Tata, chairman emeritus of Tata Sons. Citing company officials, the report said that TCS will inform the exchanges about its July-September performance after the board meeting as originally scheduled.?A scheduled call with analysts at 7 pm will be held as per schedule, they said.However, the press conference that was originally scheduled at 5:30pm in the evening today has been cancelled. In the previous quarter Q1 FY25, TCS posted a 9% increase in net profit, reaching Rs 12,040 crore, up from Rs 11,074 crore in the same period last year. Revenue from operations grew by 5%, totaling Rs 62,613 crore for the June 2024 quarter, compared to Rs 59,381 crore in the year-ago quarter. You May LikeElevate Your Life Style With 60+ AmenitiesCelestia at Siddha Sky, Sion NXUndoGoogle CEO Sundar Pichai took to X (formerly Twitter) to honor the memory of Ratan Tata, the legendary industrialist who passed away at the age of 86. \"My last meeting with Ratan Tata at Google, we talked about the progress of Waymo and his vision was inspiring to hear,\" Pichai tweeted. He praised Tata's \"extraordinary business and philanthropic legacy\" and his instrumental role in mentoring and developing modern business leadership in India.Pichai emphasised Tata's deep commitment to improving India, stating, \"He deeply cared about making India better.\" He concluded his message with condolences to Tata's loved ones.Anand Mahindra, the Chairman of Mahindra Group paid a heartfelt tribute to the late Ratan Tata, former chairman of the Tata Group. In a post shared on X, Mahindra expressed his deep sorrow and inability to accept Tata's passing. He wrote “I am unable to accept the absence of Ratan Tata. India’s economy stands on the cusp of a historic leap forward. And Ratan’s life and work have had much to do with our being in this position. Hence, his mentorship and guidance at this point in time would have been invaluable. With him gone, all we can do is to commit to emulating his example. Because he was a businessman for whom financial wealth and success was most useful when it was put to the service of the global community. Goodbye and Godspeed, Mr. T You will not be forgotten. Because Legends never die…Om Shanti” "
  },
  {
    "articleTitle": "Ratan Tata’s demise, Star Health customers’ data ‘up for sale’, campus IT hiring, JioFinance app launch and other tech news of the week",
    "articleReleaseDate": "  Oct 13, 2024, 09:06 IST",
    "article": "In the biggest news of the week, India lost its tallest business leader Ratan Tata. Tata Group chairman emeritus took his last breath at a hospital in Mumbai on October 9. Ratan Tata’s death marks the end of an era for India Inc. In other news, new claims and counterclaims are being made in the Star Health data leak. Good news for engineering students, as campus hiring by IT companies has seen a jump in the past few months.All this and more in Times of India Tech-Gadget Now’s weekly tech wrap. Ratan Tata, India's most-revered industrialist, died this week at the age of 86. Tata Group confirmed the demise of its Chairman Emeritus, who breathed his last at Mumbai's Breach Candy hospital. He was admitted to the hospital for age-related ailments last week and was transferred to the ICU on Wednesday. Read Tata Sons’ statement. You May Like|||UndoSoon after Tata died, Bill Gates, co-founder and former CEO of Microsoft; Sundar Pichai, CEO of Google; Rishad Premji, chairman of Wipro, and other top executives offered condolences to the business tycoon, expressing their admiration for Tata's leadership. Read what they all said.Star Health customers' data is available on Telegram, a hacker claimed this week. The hacker has put the entire 7.24TB data belonging to over 3.1 crore customers for open sale on a website for $150,000 (approx. Rs 57.5 lakh). The insurance company has acknowledged the data breach and Telegram has said that it has removed the bots selling the data. Here are the details.A US judge ordered Google to open Android to rival third-party app stores and allow them to manage app transactions independently. The ruling results from Epic Games' 2020 lawsuit, aiming to counter Google's monopolistic control over app distribution and in-app payments on Android devices. Here are the key points of the order.Geoffrey Hinton and John J. Hopfield have received the Nobel Prize in Physics for pioneering work on artificial neural networks. While their research laid the groundwork for current Al systems like ChatGPT, Hinton has warned about potential risks of Al, emphasising the need for safety research to keep Al under human control. Read his warning for humanity.India's IT sector is set to see a 20-25% increase in campus hiring this fiscal year, driven by demand for Al, cybersecurity, cloud computing, and data analytics. According to a report, leading firms like TCS, Infosys and Wipro are spearheading the recruitment efforts, focusing on fresh talent to address skill gaps. Read more here.Jio has announced that its 'new and improved' JioFinance App is now available for download. Launched in beta in May this year, the app is aimed to be \"a one-stop destination\" for financial services. The app is available on the Google Play Store for Android, Apple App Store for iPhones and MyJio. Here is the list of services offered.The US Department of Justice (DoJ) indicated last week that it is weighing a potential breakup of Google as a remedy in its ongoing antitrust case against the tech giant in which it is ruled that the company holds an illegal monopoly in the search market. Read how DoJ plans to 'break-up' Google.Cognizant has been found guilty of discrimination against non-Indian workers by a US court jury. The jury found that the IT major engaged in a pattern of discriminatory conduct toward non-Indian workers, demanding it to pay punitive damages to compensate employees who suffered harm. Read the full story.Emirates Airlines has banned pagers and walkie-talkies onboard following explosions in Lebanon, further suspending flights to Iraq, Iran, and Lebanon amid escalating regional tensions. Customers travelling through Dubai to Beirut are affected. Here are all the details. "
  },
  {
    "articleTitle": "TCS revenue rises over 5% in Q2, North America biz down 2%",
    "articleReleaseDate": " Updated: Oct 11, 2024, 00:37 IST",
    "article": "TCS reports a 5.5% increase in revenue for the Sept quarter, driven by growth in energy, resources, utilities, and manufacturing. The BFSI sector shows signs of recovery amidst geopolitical uncertainty. However, North America saw a decline, and operating margins decreased slightly. The company's order book stood at $8.6 billion.Read More BENGALURU: IT major TCS's revenue grew 5.5% year-on-year in constant currency in the Sept quarter. The company's mainstay banking and financial services sector showed signs of recovery even as clients continued keep IT costs down. However, its outlook on demand remains guarded as the global picture continues to show uncertainty.\"Amidst an uncertain geopolitical situation, our biggest vertical, BFSI, showed signs of recovery...Financial institutions in the US are looking at sustaining the growth momentum. Stability in the macro brings initial signs of confidence,\" TCS CEO K Krithivasan said in an investor call on Thursday.He added that with the easing of interest rates, consumer confidence and industry confidence will improve. \"This can potentially lead to improved investments. Customers are focused on operational efficiency and upgrades for the future with an eye on efficiency and automation,\" he said. You May LikeElevate Your Life Style With 60+ AmenitiesCelestia at Siddha Sky, Sion NXUndoGrowth was led by energy, resources & utilities, and manufacturing, which grew 7% and 5.3%, respectively. \"We are seeing some pressure in many accounts. Labour and supply chain constraints are impacting the industry. However, in these areas of concern, manufacturing continues to see a strong demand environment and deal pipeline,\" Krithivasan said.The banking and financial services vertical grew 0.1% in the Sept quarter compared to the year-ago period, while technology and communications saw a decline. However, its mainstay market North America saw a 2.1% decline during the Sept quarter.TCS's operating margin witnessed a quarter-on-quarter decline of 60 basis points to 24.1% in the Sept quarter from 24.7% earlier. The total order book for the period stood at $8.6 billion - a decline of over 3.5% sequentially.TCS added 5,726 employees over the last quarter, bringing the total number of employees to 612,724 in the Sept quarter. The company stated that it is on track to hire freshers. Company CHRO Milind Lakkad said TCS is considering differential compensation for each segment of hiring. \"We welcomed 11,000 associates in the first half of the year, and we remain on track for trainee onboarding as planned. We have also commenced the campus hiring process for FY26,\" Lakkad added. He said that the company was planning to hire around 40,000 freshers in the current fiscal, like what the company did previously. TCS's attrition rate in the Sept quarter stood at 12.3% like in the June quarter. "
  },
  {
    "articleTitle": "Fitting tribute: Telangana mulls naming ORR approach road to Adibatla after Ratan Tata",
    "articleReleaseDate": " Updated: Oct 11, 2024, 14:05 IST",
    "article": "HYDERABAD: State govt is contemplating the possibility of naming the Outer Ring Road (ORR) approach road to Adibatla after industrialist Ratan Tata who passed away on Wednesday.Sharing this on X, industries minister D Sridhar Babu said: \"He was very impressed with ORR and while driving on it had commented that he could land an aircraft on it. We consider it a fitting tribute to his memory to look at the possibility of naming the approach road from ORR to Adibatla after him as Ratan Tata Marg,\" Sridhar Babu said.\"The growth of high-end manufacturing in Hyderabad, especially in aerospace sector, apart from the significant presence of TCS and his encouragement to the industrial eco-system development in Telangana is laudable,\" he said. You May Like|||UndoHe said former CM YS Rajasekhara Reddy had written to Ratan Tata when the state lost Nano car project to Gujarat in 2008. \"He replied that he had something bigger in mind for Hyderabad and that's how Sikorsky helicopter project took birth in Adibatla,\" he said. "
  },
  {
    "articleTitle": "TCS, Croma, Tata Steel and other Tata websites change homepage to pay homage to Ratan Tata",
    "articleReleaseDate": "  Oct 10, 2024, 17:16 IST",
    "article": "The digital world joined the nation in mourning the passing of Ratan Tata, the iconic industrialist and Chairman Emeritus of Tata Sons. He was 86. In a touching tribute, various websites owned by the Tata Group, including those of Tata Consultancy Services (TCS), Croma, and Tata Steel, changed their homepages into solemn memorials.These websites, typically vibrant with information about products, services, and the latest company news, were replaced with simple black and white pages featuring a portrait of Ratan Tata and a concise message expressing grief and respect.This gesture served as a digital mark of respect, reflecting the profound impact Tata had on the conglomerate and its individual entities.Visitors can find links to obituaries, articles highlighting his achievements and social media pages where they could share their condolences. You May LikeElevate Your Life Style With 60+ AmenitiesCelestia at Siddha Sky, Sion NXUndoTCS has a photo of Ratan Tata and a link that redirects visitors to a statement by K Krithivasan, MD & CEO of TCS.With deep sorrow, we mourn the passing of Mr. Ratan Naval Tata, an extraordinary individual whose life and legacy will always be a guiding light for Tata Consultancy Services. His wisdom, compassion, and commitment to uplifting the lives of millions, made him revered across the world.His remarkable leadership, marked by a unique blend of humility and confidence, guided TCS through transformative global expansions, with a deep sense of service to the communities we operate in and the values we cherish. He had a rare gift for making those around him feel valued and heard, earning the admiration and respect of all who had the privilege of knowing him. His approach to leadership, paired with his genuine care for people, has left an indelible mark on every one of us.All my colleagues at TCS and I will remain forever inspired by him as we carry forward his vision.Infinti Retail Limited, or commonly known as Croma, is an Indian retail chain of consumer electronics and durable goods. It is a subsidiary of the Tata Digital. Croma, which offers over 16,000 products across 550+ brands through its stores spread in numerous major cities of India, has changed the homepage with a black and white photo of Ratan Tata.Along with a black and white portrait, the website has a media statement from Tata Sons on the demise of \"Padma Vibhushan Mr Ratan Tata\".The official website of Tata Steel has a different portrait of Ratan Tata with text \"Padma Vibhushan Mr Ratan Tata\" and \"28..1937 - 09.10.2024\" "
  },
  {
    "articleTitle": "TCS reports 4.99% increase in net profit for September quarter",
    "articleReleaseDate": "  Oct 10, 2024, 17:02 IST",
    "article": "Tata Consultancy Services (TCS), India's largest IT services firm, reported a 4.99% increase in net profit for the September quarter, reaching Rs 11,909 crore. Its revenue grew 7.06% year-on-year to Rs 64,988 crore. However, TCS shares closed down by 0.56% on the BSE.Read More NEW DELHI: Tata Consultancy Services (TCS) on Thursday reported a 4.99% increase in its net profit at Rs, 11, 909 crore for the September quarter. The country's largest IT firm had reported a net profit of Rs 11,342 crore in the year-ago period, while in the previous quarter, its post-tax net was Rs 12,040 crore.The revenues of TCS increased by 7.06 percent, going from Rs 60,698 crore in the same period last year to Rs 64,988 crore this quarter.Compared to the preceding quarter's revenue of Rs 63,575 crore, the current quarter's revenue was slightly higher.The company's profit before tax stood at Rs 16,032 crore, compared to Rs 15,330 crore in the corresponding period of the previous year.On Thursday, the TCS stock closed at Rs 4,228.40 per share on the Bombay Stock Exchange (BSE), down by 0.56 percent. In contrast, the benchmark index gained 0.18 percent. "
  },
  {
    "articleTitle": "When Ratan Tata asked Narayana Murthy on why he invited one of Infosys' 'biggest competitor' to the company's campus",
    "articleReleaseDate": " Updated: Oct 12, 2024, 14:10 IST",
    "article": "Tata Group chairman emeritus Ratan Naval Tata passed away on Wednesday night (October 9) at the age of 86. His demise marks the end of an era for Indian industry. A towering figure in Indian industry, Tata's influence extended beyond the corporate world. He was widely respected by his peers, including Infosys founder NR Narayana Murthy. Their relationship, despite their competitive businesses, became a symbol of mutual respect in the Indian corporate landscape.Murthy shared his admiration for how Tata conducted himself in both personal and professional settings, saying, \"On rare occasions when he disagreed, he was not disagreeable.Whether he was speaking to an admiring teenager, of which there are, of course, zillions in India, or to a much-respected senior business person, his sincerity, depth of knowledge, intense patriotism, and his legendary courtesy shone through effortlessly.\"In a particularly touching anecdote, Murthy remembered when he had invited Ratan Tata to inaugurate the Jamshedji Tata Room at Infosys campus in 2004. Initially surprised by the invitation given their competitive nature, Tata agreed, recognizing the significance of honoring the legacy of Jamshedji Tata, the founder of the Tata Group. You May LikeElevate Your Life Style With 60+ AmenitiesCelestia at Siddha Sky, Sion NXUndo\"He said, look, I find it somewhat unusual because TCS is your competitor. I said, no, Ratan, Jamshedji transcends all Indian companies,\" the Infosys co-founder told ET Now, recounting the incident.Murthy told Ratan Tata that Jamshedji Tata, the founder of the Tata Group, transcended business rivalries. He was a great patriot first and foremost, and Murthy believed that Ratan Tata, with his immense respect and admiration, was the ideal person to honor Jamshedji's legacy. Tata was recognized with numerous awards, including India’s second-highest civilian award, the Padma Vibhushan, in 2008, for his immense contributions to industry and philanthropy. "
  },
  {
    "articleTitle": "Google India remembers Ratan Tata with this quote",
    "articleReleaseDate": "  Oct 10, 2024, 14:50 IST",
    "article": "Ratan Tata (File photo) Ratan Tata, the chairman emeritus of Tata Sons, has died at 86. He breathed his last in Mumbai, after being hospitalised earlier this week at Breach Candy Hospital, prompting concerns about his health. As the condolences poured in from all quarters, tech companies like Google India and Infosys also paid their tributes to the former industrialist.\"Remembering Ratan Tata - A man who gave us innovation, kindness and a lot of hope.?A void that cannot be filled,\" Google India said in a post on Thursday (October 10).The post also has a photo with a Google query, \"Ratan Tata kindness quote\" and a result where Tata said that people should not \"underestimate the power of kindness\".\"Never underestimate the power of kindness, empathy, and compassion in your interactions with others.\" This quote highlights Tata's belief in the importance of human connection and compassion. You May LikeUndoHours ago, Google CEO Sundar Pichai also shared a post on X, remembering his \"last meeting with Ratan Tata at Google\".My last meeting with Ratan Tata at Google, we talked about the progress of Waymo and his vision was inspiring to hear. He leaves an extraordinary business and philanthropic legacy and was instrumental in mentoring and developing the modern business leadership in India. He deeply cared about making India better. Deep condolences to his loved ones and Rest in Peace Shri Ratan Tata JiInfosys, one of the competitors of Tata (TCS), also paid tributes to Ratan Tata in a post on X.We are deeply saddened by the loss of Ratan Tata, a visionary leader who transformed industries and touched countless lives through his integrity, innovation and philanthropy. His legacy will continue to inspire generations. "
  },
  {
    "articleTitle": "Visionary who led Tatas' revenue from $4bn to $100bn by entering businesses, building brand",
    "articleReleaseDate": " Updated: Oct 10, 2024, 12:04 IST",
    "article": "Ratan Tata's leadership transformed the Tata Group from a $4 billion entity in 1991 to a $100 billion conglomerate by 2012, seizing opportunities from India’s economic liberalisation. Key moves included selling non-core assets, international acquisitions like Jaguar Land Rover, and enhanced corporate governance. Despite challenges, Tata's innovations and resilience left a lasting impact on the Indian economy. Ratan Tata, Chairman Emeritus of Tata Sons, passed away on Wednesday at the age of 86 in a Mumbai hospital. (Photo: Instagram @Ratantata) NEW DELHI: The Tata Group today boasts a staggering revenue of $165 billion, but back in 1991, when Ratan Tata took the helm, the picture was far less impressive — just $4 billion in annual turnover. Inheriting a fragmented and bureaucratic empire, Ratan Tata didn’t just add zeros to the top line through innovations, new ventures, and international expansions, but also transformed how the group operated.By 2012, when he hung up his boots, the group had smashed through the $100 billion barrier, becoming the first Indian conglomerate to reach such heights.While he joined the group in 1962 as an assistant in Tata Industries, he stepped into the chairman’s shoes only in March 1991, when the conglomerate was dominated by an old guard, operating its divisions as semi-autonomous kingdoms, rooted in his predecessor JRD Tata’s culture of decentralisation. He removed the satraps one by one, centralising power in Bombay House, the group’s HQ.His leadership coincided with India’s economic liberalisation in the early nineties, a moment he seized amid both opportunities and threats, including the rise of competitive markets following the demise of the licence raj. You May LikeElevate Your Life Style With 60+ AmenitiesCelestia at Siddha Sky, Sion NXUndoTo adapt, Tata made bold decisions, selling off underperforming sectors like cement, textiles, cosmetics, and pharmaceuticals, while doubling down on existing es like software and steel, and entering new sectors like telecommunications, passenger cars, insurance, finance, retail, and aviation.His collaborative approach led to partnerships with international giants like Cummins, AIA, and Starbucks, enabling the group to manufacture automotive engines, sell insurance, and offer coffee from Kargil to Kochi. Acquisitions like Jaguar Land Rover, Tetley, and Corus not only fortified the group’s portfolio but also propelled it to international prominence, with over 60% of its revenues coming from operations across more than 100 countries by the end of his tenure.Central to Ratan Tata’s success strategy was his overhaul of corporate governance. He ensured that all es derived their strength from Tata Sons, the holding company. The company increased stakes in key units to over 26%, shielding them from hostile takeovers, such as the 2001 threat faced by Voltas from Lok Prakashan. He mandated that all group companies pay royalties to Tata Sons for using the Tata name, culminating in a new three-dimensional, blue-coloured logo that amplified brand value from $300 million in 1998 to a staggering $11 billion by 2012.In 2004, he took Tata Consultancy Services (TCS) public, raising $1.17 billion in India’s largest and Asia’s second-largest IPO at the time. In fact, TCS was the only major company from the group he took public. The capital raised through the IPO allowed for further acquisitions and increased stakes in Tata companies, fortifying the group’s financial foundation.However, Ratan Tata’s journey with the group was not without its challenges. In the late nineties, Tata Consumer Products found itself ensnared in a crisis when ULFA militants targeted its tea gardens for funding, throwing the company into turmoil. Additionally, the launch of the Indica car in 1998 resulted in a staggering Rs 500-crore loss for Tata Motors in FY2000, leading to shareholder discontent and Ratan Tata’s offer to resign from the chairmanship.|Reeba Zachariah is assistant corporate editor at The Times of India, Mumbai. She has been covering large Indian houses such as the Tata Group. She also reports on a host of sectors like hospitality, retail, travel, liquor and consumer durables. She has been writing on mergers and acquisitions and private equity. Read More "
  },
  {
    "articleTitle": "Hiring at engineering colleges to jump 25%: TCS, Infosys and these IT companies to lead",
    "articleReleaseDate": "  Oct 9, 2024, 13:50 IST",
    "article": "India's IT sector is reportedly gearing up for a significant increase in campus hiring this fiscal year. According to a report in Economic Times, quoted industry experts, IT campus hiring is expected to surge 20-25% this fiscal, backed by growing demand for talent in AI, cybersecurity, cloud computing, and data analytics. After a slowdown in campus hiring last year due to global economic uncertainties, companies are now prioritizing the recruitment of fresh talent to drive digital transformation initiatives and fill skill gaps.Experts told ET that the hiring of fresh talent is a positive sign for the IT sector, which reduced or paused fresh intakes from campuses last year amid global economic uncertainties and to stabilise their workforces after aggressive hiring during the pandemic.Tata Consultancy Services (TCS), Infosys, Wipro, HCLTech, and Tech Mahindra are among the top software services firms leading the hiring charge. Wipro has already onboarded 3,000 Next Gen Associates (NGAs) in the first quarter of this fiscal and plans to hire an additional 10,000-12,000 NGAs throughout the year. The company is also exploring off-campus hiring strategies and partnerships with academic institutions. You May LikeUndoTech Mahindra is looking to hire around 5,000 people from engineering campuses this year and is also participating in the Prime Minister Internship scheme. TCS has announced plans to hire up to 40,000 freshers, while Infosys is targeting around 20,000 campus recruits.Experts anticipate a 20-25% increase in fresher hiring compared to the previous fiscal year. Companies are placing greater emphasis on fresh talent to reduce their reliance on experienced lateral hires and stay ahead in the competitive market. “We're expecting fresher hiring to grow by 20-25% this year compared to FY24. Last year, hiring slowed due to global economic uncertainties, but 2024-25 is showing signs of recovery,” said Krishna Vij, vice president at TeamLease Digital.However, the overall hiring tally in 2024 is expected to be lower than the peak hirings during the pandemic years due to factors like automation and optimization of workforce. Despite the increase in campus hiring, experts caution that the IT services industry will continue to focus on recruiting individuals with new-age skills to meet the evolving demands of the market. "
  },
  {
    "articleTitle": "Why around 40,000 TCS employees have received tax demand notices for Rs 50,000 to over Rs 1 lakh",
    "articleReleaseDate": "  Sep 13, 2024, 11:44 IST",
    "article": "The notices, which were issued on September 9 top TCS employees under Section 143(1) of the IT Act, said that there was no record of the full amount paid. (AI image) TCS employees receive tax demand notices! The Income Tax Department has issued demand notices to a significant number of TCS employees, ranging from 30,000 to 40,000 individuals, due to discrepancies in their tax deducted at source (TDS) claims. The tax demand varies from Rs 50,000 to over Rs 1 lakh, depending on the employee's seniority within the company.The issue seems to have stemmed from a software glitch that caused TDS claims to not be updated on the income-tax portal, according to a TOI report.The notices, which were issued on September 9 under Section 143(1) of the IT Act, said that there was no record of the full amount paid by the assessee for the March quarter of FY24. CA Himank Singla shared on X, \"Many employees of Tata Consultancy Services are getting tax demands from the I-T department for the AY 2024-25. On checking 143(1) intimations sent by the department, the TDS claimed by the assessee has not been correctly updated by the department and hence refunds are being withheld.\" You May LikeUndoTCS has declined to comment on the matter when contacted by TOI via email. However, the company has communicated with its employees, advising them to wait for further instructions before making any payments mentioned in the notice. TCS has also informed the tax authorities about the issue and is working with them to resolve it quickly.In an internal communication, TCS has informed its employees that they have received clarification from the tax authorities. The email says, \"We understand that the tax authorities will be reprocessing the returns, post which TDS shall be in sync with Form 26AS issued by the income tax department and Form 16 Part A issued by TCS.\" The company is actively working towards resolving the issue and ensuring that the discrepancies are rectified. "
  },
  {
    "articleTitle": "RBI interest rate decision, Middle East conflict, FII trading activity to decide fate of Indian markets this week: Analysts",
    "articleReleaseDate": "  Oct 6, 2024, 14:56 IST",
    "article": "NEW DELHI: This week, investors' sentiments would hugely be impacted by the RBI’s interest rate decision, Middle East conflict and trading activity of foreign investors, according to analysts.Furthermore, market trends would also be influenced by quarterly earnings from IT bellwether TCS, domestic macroeconomic data and global oil movements.Last week’s market fall was the result of worsening Middle East tensions and withdrawn foreign funds.Pravesh Gour, Senior Technical Analyst, Swastika Investmart Ltd, said, \"On the domestic front, the market's focus will be on the RBI Monetary Policy Committee (MPC), which is scheduled to meet from October 7 to 9, 2024, with the outcome to be announced on Wednesday.\" You May LikeElevate Your Life Style With 60+ AmenitiesCelestia at Siddha Sky, Sion NXUndoThe second quarter earnings season is kicking off with TCS, he added.\"Domestically, liquidity remains strong, with signs of sectoral rotation from overvalued segments to areas with more attractive valuations. Additionally, commodity prices, the US dollar index, and key US macroeconomic data will play a crucial role in determining market direction. Geopolitical developments will also continue to be a significant factor on the global front,\" Gour stated.Last week, the BSE Sensex plunged by 3,883.4 points, or 4.53 per cent, while the Nifty dropped 1,164.35 points, or 4.44 per cent.Vinod Nair, Head of Research, Geojit Financial Services, said, \"The new milestones of both Nifty50 and Sensex of 26,000 and 85,000, respectively were short-lived as the headwinds from the Middle East and flow of FII funds to cheaper Asian peers impacted the investor sentiment. During the last week, these benchmark indices corrected by more than 4 per cent.\"In the past 5 days of heavy equity correction, market investors lost their wealth by Rs 16.26 lakh crore.\"The outlook for the market will be guided by major domestic and global economic data such as India's interest rate decision, industrial production, US FOMC (Federal Open Market Committee) meeting minutes, initial jobless claims and the UK GDP data,\" Palka Arora Chopra, Director, Master Capital Services Ltd, said.Ajit Mishra, SVP Research, Religare Broking Ltd. said that investors will be closely monitoring developments in the geopolitical situation and its impact on crude prices to predict the outcome of any investment.\"The trend in foreign flows, along with domestic flows, will also be crucial. On the domestic front, the focus will be on the outcome of the upcoming MPC meeting on October 9,\" Mishra added. "
  },
  {
    "articleTitle": "IITian who gave up TCS job to join civil services, shares his TCS offer letter from June 1984",
    "articleReleaseDate": " Updated: Oct 7, 2024, 10:48 IST",
    "article": "An IIT alumnus recently took to social media to share his inspiring career shift from a lucrative job offer at Tata Consultancy Services (TCS) to the Indian Civil Services (ICS). Rohit Kumar Singh, a retired IAS officer from the 1984 Rajasthan cadre, posted a nostalgic photo of his first job offer letter from TCS, issued in June 1984. The offer, made 40 years ago, had a salary of Rs 1,300 per month.Singh highlighted that his initial salary as an IAS officer in 1984 was Rs 2,200 per month.Singh shared a post on X (formerly Twitter) to share his appointment letter. “A little more than 40 years ago, I got my first job at TCS Mumbai through campus recruitment at IIT BHU. With a princely salary of 1300 Rupees, the ocean view from the 11th Floor of Air India Building at Nariman Point was regal indeed!,” reads the post.The letter outlines the terms and conditions of the job offer, including the salary package and role. However, the individual chose to pursue a career in the civil services instead.The post has generated significant interest and comments, with many expressing admiration for the individual's decision to prioritise public service over financial gain. Here are some You May LikeElevate Your Life Style With 60+ AmenitiesCelestia at Siddha Sky, Sion NXUndo“Sir and if you had joined, what would your current view be? Would you try to join again if given the opportunity? Just asking out of curiosity.”“That was a good salary considering Ram Prasad Dashrat Prasad Sharma got 850rs salary at Urmila traders in 1979 film Golmal”“1300 in FD for 40 years at 8% would be around 28k. TCS pays freshers 16k in 2024. Good you left @TCS. It's killer of careers.”“From 1300 rupees per month to a great civil servant...shandaar journey sir. inspiring” "
  },
  {
    "articleTitle": "Good news for freshers! Indian IT sector entry-level hiring set to double in FY25",
    "articleReleaseDate": "  Oct 1, 2024, 13:40 IST",
    "article": "Read More <p>The Indian IT industry experienced a turning point in the June quarter, with several companies reporting net headcount additions. (AI image) <br></p> Indian IT sector to see hiring revival: The IT services sector is poised for a significant resurgence in fresher hiring this year, with estimates suggesting a nearly twofold increase in entry-level recruitment compared to the previous fiscal year. Data obtained by ET indicates that the sector is expected to exceed 150,000 fresher hires in FY25.Experts attribute this positive outlook to the growing demand in , especially in the banking, financial services, and insurance (BFSI) segment, which represents the largest vertical for most IT companies. Additionally, substantial large deal wins and global expansion by major IT players contribute to this optimism. The Indian IT industry experienced a turning point in the June quarter, with several companies reporting net headcount additions after a period of decline. You May LikeElevate Your Life Style With 60+ AmenitiesCelestia at Siddha Sky, Sion NXUndoThis increase in fresher hiring comes after a subdued FY24, during which clients reduced their technology spending. IT companies have also been expanding their operations beyond their primary geographies to mitigate risks. Recent months have shown signs of recovery in core regions, especially with interest rate cuts by central banks in Europe and the US.\"FY2024 saw the lowest intake of freshers in the IT sector since 2000. However, FY2025 is expected to witness a significant rebound, with a potential 100% year-on-year (YoY) growth, surpassing 150,000 entry-level hires,\" said Kapil Joshi, Deputy CEO at Quess IT Staffing. This contrasts with the roughly 60,000 net hires reported by the $250 billion technology services industry in FY24.Aditya Narayan Mishra, MD & CEO of staffing firm CIEL HR, notes, \"Fresher hiring demand is projected to rise by 10-15% in the second half of FY25 compared to the same period last year. This growth is primarily driven by a reduction in bench strength and an optimistic industry outlook for the coming months.\" CIEL HR estimates suggest that Indian IT services firms have already hired around 150,000-170,000 freshers in the calendar year 2024.Mishra further commented, \"This reflects a cautious yet strategic hiring approach amid economic uncertainties. Compared to the same period last year, there has been an estimated 10% increase in fresher hiring, signaling a gradual recovery in the sector. Organisations are taking a balanced recruitment approach, aligning fresher intake with project demands while maintaining a prudent outlook on overall growth.\"Also Read | Infosys ‘Power’ programme offering freshers Rs 9 lakh salary; substantially higher than Rs 3-3.5 lakh entry-level fresher payAccenture, the global IT leader, reported a significant increase in headcount during the June-August quarter, with 24,000 new hires, the highest in the past ten quarters. The company's Chair and CEO, Julie Sweet, emphasized that the majority of the hiring is taking place in India, particularly in the technology sector, and includes onboarding new college graduates to refresh their talent pyramid.A report by Nuvama suggests that most companies expanded their workforce in Q1 FY25 and are now focusing on optimizing their talent pyramid. They are preparing to onboard freshers hired in the previous quarters, and this deployment is expected to contribute to future growth. Notably, Infosys has sent onboarding emails to more than 1,000 engineering graduates who had been waiting for placement for over two years.In Q1, Infosys and Wipro announced plans to resume campus hiring this fiscal year after a one-year hiatus. TCS, the industry leader, has committed to hiring 40,000 freshers in FY25, while the top four IT players, including HCLTech, have collectively pledged to hire around 82,000 freshers. Recent reports indicate that these four IT companies signed at least 33 deals in July and August, necessitating the need for talent to execute the projects. "
  }
]